[{"nbVotes":17,"interests":[282,223,770,795,181],"speakers":[561],"id":961,"title":"Java 8 et l\u0027IOT","summary":"Les nouveauté Java 8 pour l\u0027Internet des Objets","description":"Java 8 est connu pour ses Lambda, mais il recèle des nouveautés pour le monde de l\u0027embarqué, et particulièrement pour l\u0027internet des objets","language":"fr"},{"nbVotes":11,"interests":[930,21,806],"speakers":[977],"id":1251,"title":"Ionic Framework, one platform to rule them all","summary":"Comment utiliser ses compétences AngularJS pour faire un app mobile ?","description":"Ionic est le framework mobile hybride du moment, cette présentation fera un tour d\u0027horizon.\r\n\r\nEn deux mots : puissance et fun !\r\n\r\n@+","language":"fr"},{"nbVotes":6,"interests":[728,1271],"speakers":[2021],"id":1281,"title":"Sailor - a web MVC framework in Lua","summary":"This talk presents Sailor, a web MVC framework completely written in Lua.","description":"Lua is a very fast and powerful scripting language that can be easily embeddable. It can be used to develop robust applications and has been shining in industries like game development, for example. Lua is also an excellent tool as a general purpose language. However, it\u0027s use in web developments, despite its great potential and incredible benchmarks, needs to be more widespread.\r\n\r\nHaving had experience as a web programmer, and aiming to learn more about this language, I started a marathon that produced Sailor 0.1, a web MVC framework completely written in Lua after only ten days. Once the quest was completed, the feedback was so interesting that I continued the development. Sailor keeps growing each day, also with the help of contributors.\r\n\r\nThis talk presents the beginnings of Sailor framework, a comparison with other existing tools in Lua, the current stage of Sailor\u0027s development today, the official announcement of version 0.3 (Jupiter). This presentation also intends to start a debate on what we can do to spread the idea of using more Lua in web development.","language":"en"},{"nbVotes":14,"interests":[181],"speakers":[2281],"id":1631,"title":"Le pourquoi du comment du type Optional","summary":"Le type Optional a fait son apparation dans Java 8. Je vous propose de voir pourquoi et comment l\u0027utiliser?","description":"Lorsque l\u0027on découvre le monde de la programmation fonctionnelle, on est absorbé par une multitude de nouveaux concepts. Dans la masse, un concept a retenu mon attention : le type Optional. Ce type est disponible dans plusieurs langages comme Java (pas seulement la version 8), Scala, Groovy, Haskell, Ocaml, etc. Sous la forme d\u0027un live coding basé sur le langage Java, je vous propose de répondre à ces 2 questions : pourquoi et comment l\u0027utiliser ?","language":"fr"},{"nbVotes":15,"interests":[772,823,808],"speakers":[2441],"id":1711,"title":"All You Need to Know About Open Source...","summary":"Learn how to apply what you learned in Kindergarten to make your open source venture wildly successful","description":"How do you grow an Open Source software project? How do you get 100 contributors, 1,000 community members, 10,000 users or 100,000 downloads? How do you make it wildly successful?\r\n\r\nAll you need to know about Open Source you learned in Kindergarten. We just need to revisit the lessons. Open Source works because it\u0027s the right way. Open Source works because it\u0027s the best way. There are no secrets that, once revealed, bring it all crashing down. Even knowing exactly how the game works, with the cards face up on the table, we still feel good when someone thanks us for our contribution. When they don\u0027t, we might decide to vote with our feet and leave.\r\n\r\nAttend this talk to learn how to apply what you learned in Kindergarten to make your open source venture wildly successful.","language":"en"},{"nbVotes":18,"interests":[517,2981,597],"speakers":[2441],"id":1721,"title":"Reading and Writing in 20 Years","summary":"What\u0027s reading and writing going to be like in 20 years? Will we all be communicating in Mandarin, English or Emoji?","description":"Information is the “I” in IT. Arguably, the most important topic in human civilization. What\u0027s reading and writing going to be like in 20 years? Will we all be communicating in Mandarin, English or Emoji? Will plain text formats be king or will we still be fighting with WYSIWYG editors? The fate of civilization could be in our hands...or rather, our editors.","language":"en"},{"nbVotes":14,"interests":[27,199,2991,45],"speakers":[2461],"id":1731,"title":"L\u0027OpenRoadmap: les atouts de l\u0027agilité et du libre","summary":"Présentation du modèle de l\u0027Open Roadmap qui permet à différents clients de co-élaborer un produit libre","description":" Comment impliquer ses clients dans la roadmap d\u0027un logiciel libre? Comment collaborer et co-élaborer autour d\u0027un logiciel? Comment répondre rapidement aux attentes des utilisateurs?\r\n\r\nVenez découvrir/discuter de l\u0027Open Roadmap telle qu\u0027elle est mise en place et pratiquée à Enalean et qui permet à l\u0027ensemble de ses clients de participer activement  au futur du logiciel libre Tuleap.","language":"fr"},{"nbVotes":18,"interests":[4831,1621,13,808],"speakers":[1671],"id":2491,"title":"Comment HTML5 va révolutionner les CMS de demain","summary":"Comment les nouveautés apportées par HTML5 vont révolutionner la façon dont les utilisateurs vont contribuer au web","description":"Local storage, applications hors-ligne et temps réel (WebSockets), géolocalisation… le langage HTML5 apporte son lot d’innovations majeures.\r\n\r\nLes *CMS HTML5* imposeront demain de nouveaux standards dans l’expérience utilisateur, révolutionnant profondément les usages des front et back offices du Web.\r\n\r\nExemple de BackBee, CMS open source nouvelle génération.  ","language":"fr"},{"nbVotes":9,"interests":[405,4911,76],"speakers":[732],"id":2501,"title":"ElasticSearch : passez (à) l\u0027agrégation","summary":"Introduction rapide aux agrégations (ElasticSearch)","description":"Venez voir comment les agrégations, introduites dans la v1.0 d\u0027ElasticSearch, peuvent vous aider à faire parler vos données!\r\n\r\nL\u0027idée est de répondre aux questions suivantes :\r\n\r\nA quoi ça sert?\r\nComment on s\u0027en sert? \r\nPourquoi c\u0027est bien?\r\nA quoi faire attention?\r\n\r\nLe tout accompagné d\u0027un exemple et de quelques conseils.","language":"fr"},{"nbVotes":15,"interests":[4941,196],"speakers":[3461],"id":2511,"title":"La veille techno pour les vieux croûtons","summary":"La veille techno. Elle est essentielle, mais peut devenir lassante et chronophage. Comment ne pas la laisser nous dévorer ?","description":"Tout le monde est d\u0027accord : la veille techno est essentielle dans notre domaine d\u0027activité.\r\n\r\nMais plus les années passent, plus l\u0027excitation des nouvelles découvertes laisse la place à la lassitude et l\u0027ennui.\r\n\r\n    « Comment !? Encore un framework javascript ?! »\r\n\r\nCe talk se veut une petite reflexion sur la veille technologique : comment rester à jour dans un domaine en évolution constante, sans y perdre ses soirées, ses week-ends, et sans devenir dépressif-ve ?","language":"fr"},{"nbVotes":5,"interests":[5,3,3281,398],"speakers":[207],"id":2571,"title":"Dompter Angular avec Browserify","summary":"Comment browserify m\u0027a permis de dompter angular et mon build et faire du TDD sans navigateur","description":"Angular a toujours le vent en poupe, pourtant passé le tutorial, quand notre application grossit il est difficile de maintenir un build efficace, des fichiers bien organisés, et des tests unitaires rapides. \r\nBrowserify est un outil bien à la mode permettant de coder son js côté client de la même manière que celui côté serveur. \r\n\r\nEn apparence, ces deux outils ne sont pas fait pour se comprendre : Angular est une bibliothèque globale, apportant son injection de dépendance,  browserify nous amène le require.\r\n\r\n Je vous propose de montrer en 5 minutes comment faire cohabiter les deux, et en bonus comment tester ses contrôleurs tout simplement avec mocha. ","language":"fr"},{"nbVotes":15,"interests":[5081,808],"speakers":[1671],"id":2581,"title":"5 min pour choisir sa licence open source? Ok !","summary":"Parce que choisir une licence open source n\u0027a rien d\u0027effrayant, quelques rappels sur les licences open source disponibles","description":"* GPL, MIT ou Apache ?  prenons 3 minutes pour choisir 1 licence open parmi les\r\nplus connues et utilisées dans le monde open source;\r\n\r\n* \"Oui mais moi, c\u0027est pas du code que je veux open sourcer\" : l\u0027occasion de prendre 1 minute pour parler des licences *creatives commons*;\r\n\r\n* \"Et si j\u0027ai pas envie de choisir une licence ?\" :  ce que ça implique pour vous et pour autrui;\r\n\r\n**Disclaimer: étant contributeur open source, je vais probablement tenter de vous inciter à open sourcer.**\r\n\r\n*Disclaimer 2: Aucun logiciel propriétaire ne sera blessé durant la réalisation de ce lightning.*\r\n\r\n","language":"fr"},{"nbVotes":9,"interests":[5091,4731,27,5101],"speakers":[1032],"id":2591,"title":"Les PCS (Projets Créatifs Stupides)","summary":"À première vue, écrire des romans ne fait pas de moi une meilleure développeuse, et pourtant…","description":"Je suis développeuse. Mon métier, c\u0027est d\u0027écrire du code de qualité, stable, performant… Ce n\u0027est pas vraiment un métier « créatif » mais j\u0027adore ce job, et il paraît que je le fais bien.\r\n\r\nPourtant, depuis 2010, j\u0027écris un roman par an et je m\u0027amuse bien. J\u0027ai aussi codé plein de jeux vidéo en 48h au cours de Game Jams diverses et variées.\r\nCes projets ambitieux et un peu barrés, que j\u0027appelle affectueusement mes \"projets créatifs stupides\", m\u0027ont donné des clés et des outils que j\u0027utilise quotidiennement dans ma vie professionnelle… et je ne les aurais probablement pas découverts autrement !\r\n\r\nJ\u0027aimerais vous montrer les bénéfices que j\u0027ai retirés de mes PCS, et vous attirer du côté obscur de la création.","language":"fr"},{"nbVotes":11,"interests":[5101,1191,795],"speakers":[451],"id":2601,"title":"Des Raspberry dans ma maison !","summary":"Les Raspberry Pi ont envahi ma maison : idées et cas d\u0027utilisation concrets des ces nano-ordinateurs.","description":"Depuis plus de 3 ans, les Raspberry Pi, ces nano-ordinateurs à bas coût, ont petit à petit envahi ma maison (de geek).\r\n\r\nMedia Center (de voyage), box domotique, caméra IP de surveillance, seedbox, dropbox, …, les possibilités sont nombreuses pour un si petit objet. Je vous présenterai en 5 minutes ce que j\u0027ai pu mettre en place chez moi et ce que cela m\u0027a apporté en connaissances techniques et matérielles.","language":"fr"},{"nbVotes":3,"interests":[387],"speakers":[704],"id":2611,"title":"Bref, l\u0027agile est en peril","summary":"Etre agile en theorie sans l\u0027être en pratique est dangereux","description":"Ne sentez vous pas un malaise quand ces équipes pourtant agile en principe n\u0027écrivent pas de tests unitaires, et/ou n\u0027utilisent pas de serveur d\u0027intégration?\r\n\r\nJe vous propose d\u0027analyser ensemble pourquoi l\u0027agilité et si souvent mal appliquée, et quelles sont les risques liés à cette mauvaise application.","language":"fr"},{"nbVotes":5,"interests":[2481,564,3521,41],"speakers":[4031],"id":2621,"title":"Développeur dans une \"entreprise libérée\"","summary":"Travailler dans une société de service sans manager ni service commercial, à quoi ça ressemble ?","description":"Durant ma presque dizaine d\u0027année d\u0027expérience en tant que développeur, j\u0027ai connu toute sorte de boites. De la très petite startup à l\u0027éditeur de logiciel. Toutes ces entreprises avaient une propriété en commun : ce sont des entreprises \"comment\". Dans chacune d\u0027elle il y a toujours quelqu\u0027un pour vous expliquer comment faire votre travail.\r\n\r\nDepuis quelque temps mon quotidien se passe dans une société de service (SSII, ESN, comme vous voulez) qui a une particularité assez forte : aucun manager, pas de service commercial, pas de chef, pas de N+blabla. Uniquement des gens autonomes qui oeuvrent à faire les choses plutôt que d\u0027expliquer aux autres comment faire les choses. Bref, une entreprise libérée.\r\n\r\nEn quelques minutes je vais vous présenter ce que ça change concrètement, ce qui est magnifique comme ce qui est plus complexe et, j\u0027espère, vous donner envie à vous aussi de participer à une telle aventure.","language":"fr"},{"nbVotes":2,"interests":[855,387,26,258,39],"speakers":[4041],"id":2631,"title":"Expérience utilisateur sans UX design","summary":"Retour d\u0027expérience sur notre processus de design en contexte agile / lean.","description":"En contexte lean startup, aller rapidement sur le marché est une priorité absolue. Designer des applications nécessite alors une approche radicalement différente pour appliquer les bonnes pratiques UI/UX tout en les transformant en code fonctionnel.\r\n\r\nRetrait de la \"phase de conception\", prototypage rapide, binômage avec les développeurs, itérations basées sur du feedback utilisateur, en quelques minutes je vais vous présenter notre processus de design.","language":"fr"}]