[{"id":541,"title":"ES6 en pratique","summary":"Mise en avant d\u0027extraits de JavaScript à la sauce ES6 pour donner envie d\u0027essayer cette nouvelle version","description":"L\u0027idée est de présenter quelques fonctionnalités de la prochaine version de JavaScript (appelée ES6, ou encore parfois JavaScript.next() ou Harmony).\r\n\r\nAfin de coller avec le format, les fonctionnalités seront choisies selon leur intérêt, la facilité à les comprendre rapidement et leur support dans les navigateurs / JS côté serveur. Chaque fonctionnalité sera présentée avec un exemple de code \"ancienne version\" et un autre \"nouvelle version\" montrant un gain en lisibilité / expressivité, ainsi que des informations concernant son support.\r\n\r\nEn pratique, le talk débutera par une présentation rapide de ce qu\u0027est ES6 (1min), suivi des fonctionnalités (probablement au nombre de trois, 3min), suivi d\u0027une vue d\u0027ensemble des solutions pour essayer ES6 soi-même (Node --harmony, Chrome 35+, Traceur Compiler, 1min).\r\n\r\nJ\u0027ai déjà présenté devant de petites audiences (20-30pers) dans un cadre professionnel et dans certains User Group de Montpellier. Avant la conférence, ce talk sera présenté en version allongée à mes collègues de travail.\r\n\r\nNB : le titre pourrait être ajusté selon l\u0027inspiration du moment (\"ES6 en pratique\", \"ES6 en bref\", \"ES6 pour de vrai\", etc).","language":"fr","interests":[5,898,897,899],"speakers":[1070],"nbVotes":40},{"id":543,"title":"Blogger chaque jour pour être riche et célèbre","summary":"Comment devenir riche et célèbre, un jour à la fois, un acticle à la fois.","description":"Je vous propose un bilan, que j\u0027espère humoristique, de mon expérience qui consiste, depuis deux mois, à écrire un blog post par jour. Cela sera l\u0027occasion de vous dévoiler mes ficelles et mes outils. De vous expliquer ce que cette discipline me donne en retour (richesse et célébrité ?). Mais aussi de partager ma détresse. Depuis deux mois, je ne dors plus ni ne mange, accaparé par l\u0027écriture de nouveaux articles.","language":"fr","interests":[908,907,909,910],"speakers":[991],"nbVotes":59},{"id":544,"title":"De l\u0027architecture dans les CSS","summary":"Comment vivre avec ses CSS sur le long terme, quand toute votre équipe met le nez dedans !","description":"Présentation de la stack Grunt (relative aux CSS) d\u0027un site grand public.\r\nJe vais parler en particulier de la solution que nous avons adressé au problème suivant :\r\nComment fragmenter ses CSS et gérer les dépendances de ces fragments ?","language":"fr","interests":[572,658,287,569,153],"speakers":[997],"nbVotes":38},{"id":545,"title":"#Restful, really ?","summary":"Faire une architecture de type Rest, que cela implique-t-il vraiment ?","description":"Tout le monde dit faire ou vouloir faire une architecture de type Rest, que cela implique-t-il vraiment ?\r\n\r\nOù vous situez-vous sur le \"Richardson Maturity Model\" ? Votre API est à la fois Hypermedia et JSON, « Are you kidding ? » \r\n\r\nSi ce sont des questions qui vous taraudent l\u0027esprit et même vous empêchent de dormir, alors venez écouter ce talk pour avoir des pistes de réflexions, des échanges et peut-être des réponses, qui sait ?\r\n","language":"fr","interests":[932,911,240,241,923,287,135,924],"speakers":[977],"nbVotes":37},{"id":547,"title":"Ansible, la gestion de configuration facile","summary":"Introducation à Ansible, outil de gestion de configuration simple","description":"Ansible est un outil de gestion de configuration dans la veine de Puppet et Chef. Destiné aux devops, il est particulièrement simple à utiliser et rapide à prendre à main.\r\nCinq minutes c\u0027est largement suffisant pour présenter les concepts de l\u0027outil, quelques exemples et une démo !","language":"fr","interests":[481],"speakers":[89],"nbVotes":31},{"id":548,"title":"Ateliers de code pour enfants et ukulélé rose","summary":"Animer un atelier pour enfants et utiliser un ukulélé rose, c\u0027est pareil. Et ce n\u0027est absolument pas une plaisanterie.","description":"Musicien et codeur, ce n\u0027est pas toujours une situation exceptionnelle, nous sommes nombreux dans ce cas.\r\nIl est parfois possible de trouver des parallèles entre les deux mondes.\r\n\r\nLorsque je me suis lancé à participer à des ateliers de code pour enfants, les sensations que j\u0027ai eu m\u0027ont rappelé une situation que j\u0027avais déjà vécue dans mon expérience musicale.\r\n\r\nLe rapport avec un ukulélé ?\r\nUn ukulélé rose ?\r\n\r\nLà, il va falloir voter dur pour mon lightning pour que je vienne vous expliquer ça en 5 minutes ;)","language":"fr","interests":[810,206,352],"speakers":[33],"nbVotes":25},{"id":549,"title":"Gamification et communauté Open Source ","summary":"REX sur la gamification dans une communauté Open Source","description":"Une des problématiques dans les communautés Open Source est de valoriser et d\u0027impliquer les contributeurs.\r\nLa gamification permet en détournant les mécanismes humain du jeu de résoudre en partie ce problème.\r\n\r\n[Mozilla badges](http://openbadges.org/) est un standard ouvert et intéropérables de système de reconnaissance.\r\nLe lightning présentera également son implémentation au sein de la communauté fedoraproject.org et les premiers retours d\u0027expériences:\r\nhttp://badges.fedoraproject.org/","language":"fr","interests":[738,804,808],"speakers":[152],"nbVotes":32},{"id":552,"title":"REX Lean startup","summary":"REX Lean startup","description":"Retour d\u0027expérience d\u0027un petit projet perso crée il y a 10 mois en lean startup sauvage. Je ne suis pas milliardaire en euros mais j\u0027ai appris plein de choses. J\u0027espère évoquer une ou deux idées en 5 mn de lightning talks.\r\n\r\nAujourd\u0027hui, ce side project\r\n* draine ~20 000 visiteurs par mois sur le site\r\n* fait attendre 271 personnes intéressées par une application mobile\r\n* fait testé une version Android à 15 personnes\r\n* est rentré dans ses frais (pour encore quelques mois)","language":"fr","interests":[35],"speakers":[1016],"nbVotes":18},{"id":553,"title":"Don\u0027t use Git","summary":"You think Git is awesome? You think it\u0027s better than SVN? Your wrong and I will tell you why. - Attention: Sarcasm \u0026 fun included ;)","description":"Are you using Subversion or CVS? That\u0027s great, whatever you do, don\u0027t migrate to Git! Git makes you work overtime, confuses developers with too many options, destroys the social interaction with your co-workers and much more. Git has unnecessary features like offline commits and cherry picking that nobody needs at his day job. Your code is the most important thing for your software development and you should use a mature technology for storing it. Let the kids play around with Git.\r\nIn this ironic lightning talk I will give you 5 reasons, why you shouldn\u0027t use Git always with a twinkle in the eye. So create a new branch in SVN and come to my session while you checkout the branch.","language":"en","interests":[922,14],"speakers":[1002],"nbVotes":30},{"id":554,"title":"Dart, alternative à JS (?) : retour d\u0027expérience","summary":"Dart, alternative à JS (?) : retour d\u0027expérience","description":"En octobre 2013, j\u0027assiste à une conférence sur un langage qui m\u0027est inconnu : Dart.\r\nLe langage se veut une alternative au JavaScript, rien que ça ! Google est derrière, on peut donc s\u0027attendre à tout.\r\n\r\nLa plateforme me plait, j\u0027ai envie de voir ce que l\u0027on peut faire avec. Je me lance donc dans un projet personnel : bâtir \"from scratch\" une application web en Dart (client et serveur).\r\n\r\n(...)\r\n\r\nAujourd\u0027hui, l\u0027application existe[1], j\u0027ai \"collaboré\"[2] avec Seth Ladd[3] (auteur de Dart in Action et Dart advocate chez Google), j\u0027ai écris un article sur le déploiement automatique d\u0027application Dart[4] et (peut etre) je fais un lightning talk sur Dart.\r\n\r\nQue s\u0027est il passé ? \r\n\r\nJe présenterai, le langage, la plateforme, et mes conclusions après 6 mois d\u0027exploration. \r\n\r\n\r\n[1] http://www.la-boussole.info\r\n[2] https://github.com/igrigorik/heroku-buildpack-dart/pull/26#issuecomment-31756043\r\n[3] http://www.sethladd.com/\r\n[4] http://gereinhartasdartisan.blogspot.fr/2014/01/dart-automatic-deployment-in-cloud.html","language":"fr","interests":[20],"speakers":[1162],"nbVotes":30},{"id":555,"title":"MeteorJs, another JS framework ?","summary":"There is a lot of JS frameworks and Meteor is coming out to v1 in few weeks, but why is it so good ?","description":"In 5 minutes, i\u0027ll make you love MeteorJs.\r\n\r\n * Use collection on both server and client to persist data\r\n\r\n * Reactivity locally and remotely using easy pub/sub and a simple Template engine\r\n\r\n * Authentification embedded to use google or twitter or whatever\r\n\r\n * Easy deployment\r\n\r\nDon\u0027t get bothered with websocket library, neither with building your own node stack nor with deployment. Meteor is doing the best for you, just focus on features !","language":"en","interests":[5,944],"speakers":[77],"nbVotes":12},{"id":556,"title":"Paf! le chien","summary":"Paf! Le chien production présente... C’est l’histoire d’un mec qui voulait traverser la route, et … PAF il reste cloué au trottoir !","description":"Pourquoi ? Comment ? \r\nDécouvrez un pattern commun de réflexion entre improvisation et culture agile. \r\nA réutiliser tout de suite pour augmenter la performance des individus et des équipes.\r\nVenez trouver tout ce que vont vous apporter les techniques d’improvisation pour produire plus efficacement des incréments agiles, logiciels ou non.\r\n#improfessionnalisation\r\n\r\nTalk inspiré des principes et pratiques du théâtre d\u0027improvisation.\r\n!! Attention, malgré tout le sérieux apporté à la préparation de ce talk, il risque de comporter des blagues pas drôles !!\r\n - Parallèle avec valeurs et pratiques agiles : jeux agiles, scribing, ...\r\n - Parallèle avec le Lean Startup\r\n - Retours d\u0027expérience\r\n\r\n\r\nMini-bio : Coach\u0027Agile, Scrum Master, facilitateur, formateur, et joueur (Innovation Games, Agile Games, Collaborative Games)\r\n","language":"fr","speakers":[160],"nbVotes":18},{"id":557,"title":"Gestion moderne des ressources en C++11","summary":"Gérer proprement ses ressources sans garbage collector, c\u0027est possible mais aussi plus efficace !","description":"Beaucoup de développeurs ont une image dépassée de C++ : ils ont en tête des pratiques obsolètes qui impliquent une gestion lourde et périlleuse de ses ressources.\r\n\r\nLe but de cette présentation est de résumer les évolutions du langage et de sa pratique au cours des 15 dernières années qui permettent aujourd\u0027hui d\u0027écrire un code plus simple, plus robuste ET plus performant qu\u0027une approche à base de garbage collector.\r\n\r\nVous êtes sceptique et / ou curieux ? Alors préparez-vous à être étonné !","language":"fr","interests":[741,94],"speakers":[1023],"nbVotes":6},{"id":558,"title":"Software esotericism","summary":"As programmers we are making programs. But what is a program?","description":"During this talk, I\u0027ll try to define what a program is in the most abstract way possible.\r\n\r\nForget computer programs: they are poor copies of genetic programs. YOU are a running instance of such program contained in your DNA. This is the fractal nature of the universe in action: (LISP) programmers are programs outputting programs outputting programs...\r\n\r\nWhat does it implies? Is there something important to realize about that which could help me in my daily life?\r\n\r\nOf course there is! And realizing that thing can bring your programming activity to a completely new level of experience!","language":"en","speakers":[1023],"nbVotes":10},{"id":560,"title":"5 apprentissages pour le programmeur débutant","summary":"Enseigne-t-on les choses essentielles aux programmeurs débutants? Les algorithmes, les langages, la syntaxe, est-ce vraiment ce qui compte?","description":"15 ans d\u0027expérience dans l\u0027informatique, 2 ans de cours à l\u0027IUT de Lyon, 3 ans de contributions journalières à StackOverflow, m\u0027ont permis de découvrir que des aspects essentiels de la programmation (et particulièrement, de la programmation en Java), sont négligés par les enseignants. \r\nLes connaissances prennent le pas sur la démarche. La syntaxe prend le pas sur la logique. \r\n\r\nDans cette présentation en 5 minutes, je parlerai de 5 choses, négligées à mon sens par les enseignants, qu\u0027il faut apprendre aux apprentis programmeurs, que nous avons été, et que nous sommes toujours.","language":"fr","interests":[928,929],"speakers":[669],"nbVotes":37},{"id":561,"title":"Ionic Framework : retour d\u0027expérience ","summary":"Faire du dev mobile hybride c\u0027est bien, le faire avec Ionic Framework c\u0027est mieux !","description":"Je ferais la présentation d\u0027une app mobile hybride qui utilise Ionic Framework pour vous montrer que Cordova, AngularJS et Grunt font bon ménage !\r\n\r\nAvec un zeste de Karma pour les tests unitaires en continue dans l\u0027environnement de développement.\r\n\r\nEt la démonstration se fera sur simulateur iPhone iOS 7.","language":"fr","interests":[930,21,806,931],"speakers":[977],"nbVotes":9},{"id":562,"title":"L\u0027agilité va mourir - ceci n\u0027est pas un troll","summary":"Pourquoi l\u0027agilité a échoué, selon Mike Hadlow, et comment s\u0027en sortir ?","description":"Inspiré du point de vue du développeur senior Mike Hadlow : \"Pourquoi l\u0027agilité a échoué\".\r\nAu-delà du buzz, n\u0027hésitez pas à venir troller dans cette session.\r\nQuoi qu\u0027il en soit le risque est bien là. Est-ce un bien ou un mal ? \r\n\r\n- Échangeons sur ces idées, arguments, causes.\r\n- Explorons aussi les causes et les quelques pistes proposées pour repartir du bon pied.","language":"fr","speakers":[160],"nbVotes":21},{"id":563,"title":"Programmer sans coder: BDK, Scratch ou Blockly","summary":"La programmation a la porté de tous","description":"A l\u0027heure de la montée en puissance de l\u0027informatique à tous les étages, de la domotique à la robotique en passant par les Smartphones, il est urgent de redonner la possibilité de programmer à tout le monde.\r\nNous allons faire un tour d\u0027horizon de la programmation par composant du BDK à blockly en passant par le fameux Scratch\r\n\r\n","language":"fr","interests":[282,935,934,2,936],"speakers":[1201],"nbVotes":9},{"id":564,"title":"Project Atomic","summary":"Bringing Docker to the enterprise world","description":"Since its release, Docker has been a hot topic in the IT world by industrializing the way we package and deploy applications.\r\n\r\nProject Atomic aims to simplify the maintainance and enhance the security of Docker hosts by mixing various Linux technologies: SELinux, systemd, cgroups, and GearD (from OpenShift) and Cockpit a brand new unified UI to manage your containers-based infrastructure.\r\n\r\nAtomic hosts will provide a minimal Operating System based on Fedora/RHEL/CentOS to run securely Docker containers with the flexibility of existing distributions while providing atomic upgrades and rollback.","language":"en","interests":[477,939,738,937,943,942,940,941,938],"speakers":[152],"nbVotes":14},{"id":565,"title":"Mon responsable va mieux","summary":"L\u0027histoire de Robert, manager dans l\u0027IT. Les difficultés rencontrées et les solutions apportées.","description":"C\u0027est l\u0027histoire de Robert, manager dans l\u0027IT, qui a connu bien des difficultés, entre les besoins changeant des clients et le code endetté.\r\nJe vais vous raconter son parcours, et vous dire ce que ses expériences lui ont appris.\r\nDans l\u0027esprit de mix-it (des idées pour tout de suite), vous repartirez (je l\u0027espère !) avec une idée simple à exploiter rapidement, ou à proposer à votre encadrement.","language":"fr","interests":[41],"speakers":[13],"nbVotes":31},{"id":566,"title":"Fun, code, jeux et SSII : the gang of four !","summary":"Un coin de paradis dans une SSII : créer un serious game et faire coder mon directeur technique.","description":"Pour progresser (un peu), découvrir (beaucoup) et s’amuser (totalement), pourquoi ne pas créer votre propre serious game ? En 5 minutes, je vous présenterai les deux jeux que nous avons mis en place :\r\n- un challenge de sécurité applicative\r\n- une bataille d’IA dans l’espace\r\n \r\nPourquoi faire ? Comment faire ? Et surtout, qu\u0027est-ce que cela nous a apporté ?\r\n \r\nPour vous mettre le pied à l\u0027étrier, nos jeux vous seront ouverts ! Vous vous sentez plutôt amiral interstellaire ou pirate informatique ?\r\n","language":"fr","interests":[950,949,945],"speakers":[709],"nbVotes":23},{"id":567,"title":"A quoi servent les Rules Junit ? ","summary":"Comprendre les Rules Junit et en quoi elles peuvent nous aider dans l\u0027écriture de nos tests unitaires avec Junit","description":"Comment faites vous pour partager des comportements entre vos tests ? L\u0027abstraction, les Runners ? Il existe une troisième manière de le faire en utilisant les Rules Junit. Le but de ce lightning talk est de montrer en 5 minutes, ce que l\u0027on avait l\u0027habitude de faire et ce que l\u0027on peut faire avec des Rules Junit. ","language":"fr","interests":[974,973],"speakers":[252],"nbVotes":9},{"id":568,"title":"[FR/EN] Lightning Talk Hacking","summary":"Time and space offered to anyone who has something to say, for free !","description":"1 ou plusieurs personnes selon les volontaires, max 5 personnes x 1 minutes.\r\nVenez nous parler de ce qui vous fait vibrer en ce moment, dans l\u0027instant, ce qui vous a plu et ému à MIX-IT le matin même, etc.\r\nRetrouvons le pouvoir du moment présent grâce à la confiance, et l\u0027auto-organisation.\r\nIl suffira de se lever et d\u0027aller s\u0027adresser à l\u0027auditoire.\r\n\r\nCe hack repose sur le principe de détourner un espace temps et lieu :\r\n-   avec les talents de chacun,\r\n-   un but : le plaisir de partager tout de suite des idées pour tout de suite.\r\n\r\n-- \r\n\r\n1 or more persons, max 5 persons x 1 minute.\r\nCome on and talk about what excite you right now, about what you liked at MIX-IT this morning, and so on.\r\nGet back to the present moment thanks to trust, and self-organization.\r\nIt\u0027s easy : just stand up and go talking to the audience.\r\n\r\nThis hack is based on releasing space and time for you :\r\n-   with talents of anyone,\r\n-   with a goal : the pleasure to share right now some ideas for right now.","language":"fr","speakers":[160],"nbVotes":4},{"id":569,"title":"How and why hack the Lib C","summary":"LibC hacking can give super power to your app. Discover a new world in 5 minutes.","description":"In few minutes you will learn what is the LibC, how you can hack it, and have an overview of super power that you can give to any of your app.","language":"en","interests":[92,951,156],"speakers":[371],"nbVotes":4},{"id":570,"title":"The innovator\u0027s dilemma","summary":"Discover the Innovator\u0027s dilemma, the reference book about management and disruptives technologies","description":"The Innovator\u0027s dilemma is the reference book about management and disruptives technologies.\r\nIn few minutes, lets discover concepts described in this book and see why traditionnal management solutions are not adapted for disruptives technologies.","language":"en","interests":[845,863,453],"speakers":[371],"nbVotes":3}]