[{"logo":"http://www.mix-it.fr/public/images/logo-viseo.png","level":"SILVER","interests":[67,27,507,24,2,3511,2751,13,780],"id":168,"lastName":"Viseo","login":"VISEO","company":"VISEO","shortdesc":"La BU Technologies de VISEO conseille, accompagne en AMOA et délivre des projets agiles dans les architectures objet et web \u0026 mobiles.","longdesc":"A PROPOS DU GROUPE VISEO – www.viseo.com \n\nEn s’appuyant sur ses expertises dans les domaines du digital, des technologies, des process et de la data, VISEO vous accompagne dans vos chantiers de transformation et vous aide à faire émerger de nouvelles idées, de nouvelles offres, de nouveaux modes de collaboration, de nouvelles manières de produire et de vendre.\n\nAvec 1 200 collaborateurs répartis sur quatre continents et un chiffre d\u0027affaires supérieur à 110 millions d\u0027euros, VISEO vous propose une alternative aux intégrateurs, agences et cabinets de conseil, en imposant une approche unique, souple, innovante et structurante.\nVISEO vous apporte ainsi une réponse globale et vous aide à mettre en œuvre des projets complexes pour faire face aux enjeux numériques qui impactent les systèmes d\u0027information, les métiers ou les organisations. ","urlimage":"http://www.gravatar.com/avatar/77d44eecbc7541fc5d94055f7fc74e31","nbConsults":1686,"sharedLinks":[{"name":"Blog","url":"http://blog.viseo-bt.com/"},{"name":"LinkedIn","url":"https://www.linkedin.com/company/objet-direct?report%2Esuccess\u003d6vo3TCkCS1-Q3MQSXyAa5EmbyooXt_JHF4gI-SlS5O9Glwt8CaN1ZzdSFMOjqCEC4tgoZJl1pOO90MRDlW9NQp"}]},{"logo":"http://www.mix-it.fr/public/images/logo-woonoz.png","level":"BRONZE","id":227,"lastName":"Woonoz","login":"woonoz","company":"Woonoz","shortdesc":"WOONOZ est un éditeur Lyonnais, pratiquant l\u0027agilité, et développant des solutions d\u0027aide à la mémorisation de contenu de formation.","longdesc":"","urlimage":"http://www.gravatar.com/avatar/6036f967736bd3a6737b680ef48c6208","nbConsults":1628,"sharedLinks":[{"name":"Projet Voltaire","url":"http://www.projet-voltaire.fr"},{"name":"Woonoz","url":"http://www.woonoz.com"}]},{"logo":"http://www.mix-it.fr/public/images/logo-neosoft.png","level":"SILVER","id":1721,"lastName":"Neosoft","login":"neosoftlyon","company":"NEO SOFT LYON","shortdesc":"Néo-Soft Services, reconnue par son modèle social atypique, sa capacité d\u0027innovation, sa réactivité et son service de qualité.","longdesc":"Chargée des Ressources Humaines au sein de l\u0027agence NEO SOFT Lyon, n\u0027hésitez pas à me contacter si vous souhaitez rejoindre une société responsable, dotée d\u0027un modèle social innovant: drhlyon@neo-soft.fr\n\nNEO-SOFT est une Société de Services spécialisée en R\u0026D et Systèmes d\u0027information, créée en 2005, avec près de 680 collaborateurs sur le groupe.\n\nL\u0027agence de Lyon a vu le jour en 2013, et compte aujourd\u0027hui plus de 40 collaborateurs. Nous intervenons sur les métiers d\u0027étude et développement, principalement en informatique de gestion, ainsi que sur les métiers d\u0027infrastructure, notamment en systèmes, réseaux et exploitation. \n\nDoté de 10 implantations (Lyon, Rennes, Nantes, Paris, Bordeaux, Toulouse, Niort \u0026 Limoges, Marseille \u0026 Aix en Provence) le groupe est reconnu entreprise responsable - RSE LUCIE - 3ème SSII en France parmi 1700. \n\nLa volonté de NEO-SOFT est de mettre à disposition des acteurs locaux sa réactivité et sa capacité à capitaliser les compétences afin de fournir des prestations de services de qualité, adaptées aux besoins locaux. \n\nSSII certes, NEO-SOFT n\u0027impose pas de mobilité à son personnel ni de période d\u0027essai employeur, ainsi les équipes techniques Lyonnaises sont stables, motivées et peuvent s\u0027impliquer sur la durée, ce qui permet de capitaliser les compétences locales.","urlimage":"http://www.gravatar.com/avatar/4d47f8ea60a9d6c52231e667622676b8","nbConsults":313,"sharedLinks":[{"name":"VIADEO","url":"http://www.viadeo.com/fr/company/neo-soft1"},{"name":"LINKEDIN","url":"http://www.linkedin.com/company/neo-soft-services"},{"name":"BLOG","url":"http://neosoft-leblog.blogspot.fr/"},{"name":"FACEBOOK","url":"https://www.facebook.com/neo.soft.groupe"}]},{"logo":"http://www.mix-it.fr/public/images/logo-fiducial.png","level":"BRONZE","id":1731,"lastName":"Fiducial","login":"FIDUCIAL","company":"FIDUCIAL ","shortdesc":"FIDUCIAL leader des services pluridisciplinaires aux petites et moyennes entreprises.","longdesc":"FIDUCIAL propose une offre complète de produits et services dans les domaines du droit, de l’expertise comptable, de l’audit, du commissariat aux comptes, du conseil financier, de l’informatique, de l’équipement du bureau et de la sécurité.\n\nLes métiers informatiques sont nombreux et variés chez FIDUCIAL. Nous avons aujourd’hui une culture informatique triple :\n•\tGrand compte avec la DSI Groupe de + de 100 personnes avec une diversité de technologies liée à nos métiers variés,\n•\tEditeur avec FIDUCIAL INFORMATIQUE, 460 personnes, partenaire Gold Microsoft,\n•\tStart Up avec Y Proximité (sites web) et Fiducial Cloud.\n\n\n","urlimage":"http://www.gravatar.com/avatar/5118eab6b170cd970c8888510f8c1361","nbConsults":279,"sharedLinks":[{"name":"FIDUCIAL Recrute","url":"http://recrute.fiducial.fr/"}]},{"logo":"http://www.mix-it.fr/public/images/logo-xebialabs.png","level":"SILVER","interests":[16,2271],"id":2011,"lastName":"XebiaLabs","login":"XebiaLabs","company":"XebiaLabs","shortdesc":"XebiaLabs est éditeur de solutions d\u0027automatisation des déploiements, des livraisons et des tests pour le Devops et Continuous Delivery.","longdesc":"Avec plus de 15 ans d\u0027expérience dans les technologies Java EE, du développement aux problématiques d\u0027architecture d\u0027applications complexes, Benoit a toujours été intéressé par les problématiques d\u0027automatisation tout d\u0027abord côté développement (via son implication dans le projet Ant et l\u0027intégration continue), et depuis 5 ans chez XebiaLabs dans les domaines du Devops et du Continuous Delivery.","urlimage":"http://www.gravatar.com/avatar/1b12faa25b28561a528d2ff6b748153a","nbConsults":336,"sharedLinks":[{"name":"Site web XebiaLabs","url":"http://xebialabs.com/"},{"name":"Blog XebiaLabs","url":"http://blog.xebialabs.com/"}]},{"logo":"http://www.mix-it.fr/public/images/logo-alfene.png","level":"BRONZE","id":2291,"lastName":"Alfene","login":"alfene","company":"alfene","shortdesc":"alfene intervient en recrutement de compétences / expertises","longdesc":"","urlimage":"http://www.gravatar.com/avatar/e0f63844cc69a088416f1522cb4d2fa2","nbConsults":266,"sharedLinks":[{"name":"alfene","url":"http://www.alfene.com"}]},{"logo":"http://www.mix-it.fr/public/images/logo-google.png","level":"BRONZE","id":422,"lastName":"Google","login":"google","company":"Google","shortdesc":"Développeurs mobile, web ou cloud ? Retrouvez-nous sur nos pages [Google+](http://plus.google.com/111395306401981598462/)!","longdesc":"Développeurs mobile, web ou cloud? Rendez-vous sur les pages G+ [Google Developers](http://plus.google.com/111395306401981598462/) et [Android Developers](http://plus.google.com/108967384991768947849) pour découvrir les dernières nouveautés d\u0027Android, Chrome, App Engine et la galaxie des APIs Google!","urlimage":"http://www.gravatar.com/avatar/cd848a8812c20a2df5fb88c6b8a82c61","nbConsults":1496,"sharedLinks":[]},{"logo":"http://www.mix-it.fr/public/images/logo-cgi.jpg","level":"BRONZE","interests":[74,387,16,409,779],"id":992,"lastName":"CGI","login":"CGI","company":"CGI","shortdesc":"[CGI](http://www.cgi.fr), pour la seconde année, s’associe au Mix-IT pour promouvoir l’innovation, le développement, l’agilité et le plaisir","longdesc":"Fondé en 1976, Groupe CGI inc. est la cinquième plus importante entreprise indépendante de services en technologies de l\u0027information et en gestion des processus d\u0027affaires au monde. Grâce à ses quelque 68 000 professionnels, CGI offre un portefeuille complet de services, y compris des services-conseils stratégiques en informatique et en management, des services d\u0027intégration de systèmes, de développement et de maintenance d\u0027applications informatiques, de gestion d\u0027infrastructures technologiques ainsi qu\u0027une vaste gamme de solutions exclusives à des milliers de clients à l\u0027échelle mondiale à partir de ses bureaux et centres mondiaux de prestation de services dans les Amériques, en Europe et en Asie-Pacifique. CGI génère des revenus annuels de plus de 10 milliards de dollars canadiens et la valeur de son carnet de commandes s’élève à plus de 20 milliards de dollars canadiens. Les actions de CGI sont inscrites à la Bourse de Toronto (GIB.A) ainsi qu\u0027à la Bourse de New York (GIB). Site Web : www.cgi.com","urlimage":"http://www.gravatar.com/avatar/bb56b6b99d33604a570aa572bd246e70","nbConsults":2040,"sharedLinks":[{"name":"CGI","url":"http://www.cgi.fr"},{"name":"CGI sur LinkedIn","url":"http://www.linkedin.com/company/cgi"},{"name":"CGI sur Viadéo","url":"http://fr.viadeo.com/fr/company/cgi"},{"name":"CGI sur Facebook","url":"https://fr-fr.facebook.com/CGIFrance"},{"name":"CGI sur YouTube","url":"https://www.youtube.com/user/LogicaFRA"}]},{"logo":"http://www.mix-it.fr/public/images/logo-soprasteria.png","level":"SILVER","id":1661,"lastName":"Sopra Steria","login":"Sopra Steria","company":"Sopra Steria","shortdesc":"Leader européen de la transformation numérique - Conseil, Intégration de systèmes, Edition de solutions métier et Business Process\nServices","longdesc":"Sopra Steria propose l’un des portefeuilles d’offres les plus complets du marché : conseil, intégration de systèmes, édition de solutions métier et Business Process Services. Il apporte ainsi une réponse globale aux enjeux de développement et de compétitivité des grandes entreprises et organisations. Combinant valeur ajoutée et innovation dans les solutions apportées, ainsi que performance des services délivrés, Sopra Steria accompagne ses clients dans leurs programmes de transformation, aussi complexes soient-ils, et les aide à faire le meilleur usage du numérique. Fort de 35 000 collaborateurs dans plus de 20 pays, le Groupe Sopra Steria affiche un chiffre d’affaires pro forma 2013 de 3,1 milliards d’euros.\n\nLa région Rhône-Alpes Auvergne compte 1200 collaborateurs répartis sur 4 sites : Lyon; Grenoble, Annecy et Clermont-Ferrand.\nForts de nos grands projets de transformation autour des nouvelles technologies et de l’innovation, nos équipes accompagnent nos clients grands comptes sur des environnements sectoriels (Industrie, Énergie, Transport, Tertiaire…) et technologiques (JEE, .Net, SAP, BI, Mobilité, etc.) variés. \nAfin de répondre aux enjeux stratégiques de nos clients, nous souhaitons renforcer nos équipes de différents types de profils tels que :\n- Ingénieurs d\u0027études Nouvelles Technologies (JEE / .net / PHP)\n- Consultants BI\n- Consultants SAP\n- Chefs/Directeurs de projet\n- Architectes\n- Consultants AMOA\n\nRetrouvez toutes nos opportunités sur http://www.soprasteria.com/fr/carrieres\n\nPour toutes questions : olivia.joubert@soprasteria.com","urlimage":"http://www.gravatar.com/avatar/072b3333ef0be343b1bac3a88c9ebd83","nbConsults":300,"sharedLinks":[{"name":"Site Sopra Steria","url":"http://www.soprasteria.com/fr/carrieres"}]},{"logo":"http://www.mix-it.fr/public/images/logo-sii.png","level":"BRONZE","id":1811,"lastName":"SII Rhône-Alpes","login":"SII_rhonealpes","company":"Groupe SII","shortdesc":"SII Rhône Alpes: une agence dynamique et en plein développement","longdesc":"Société d’ingénierie, de conseil et de formation en technologies, le Groupe SII accompagne les évolutions informatiques de nombreuses entreprises.\nSes équipes d’experts sont mobilisées pour créer et mettre en œuvre des solutions à forte valeur ajoutée pour leur permettre de relever le défi de l’innovation.\n\nAujourd\u0027hui, le Groupe SII compte 4 850 collaborateurs dans 13 pays et 50 implantations dans le monde dont 9 agences en France : Aix en Provence, Ile de France, Lille, Lyon, Nantes, Rennes, Sophia Antipolis, Strasbourg, Toulouse.\n\nDepuis sa création en 1979, la société offre des réponses adaptées aux besoins de ses clients avec : \n·\tUne expertise métiers et sectorielle reconnue\n·\tDes solutions clés en main\n·\tL\u0027intégration de solutions logicielles\n·\tDes modes d\u0027intervention modulables et évolutifs\n\nSII propose ainsi différents types d\u0027interventions pour couvrir l\u0027intégralité du cycle d\u0027un projet : \n·\tLe conseil et les études en amont\n·\tLa formation par des experts métiers\n·\tL\u0027ingénierie de développement\n·\tLes tests, le déploiement et la maintenance","urlimage":"http://www.gravatar.com/avatar/a46568e2d4e3a7a2e55a3e877afd5456","nbConsults":329,"sharedLinks":[{"name":"Site SII Lyon","url":"http://lyon.groupe-sii.com/fr/"}]},{"logo":"http://www.mix-it.fr/public/images/logo-enalean.png","level":"SILVER","interests":[27,3631,4241,956,4231,4251,4221,16,4211,453],"id":2811,"lastName":"Enalean","login":"Enalean","company":"Enalean","shortdesc":"Enalean, éditeur disruptif en ingénierie logicielle. Développeurs de Tuleap, suite open source de Gestion des Développements Logiciels -ALM.","longdesc":"\nChez Enalean, notre mission c\u0027est de permettre à nos clients de faire du logiciel :\n- Plus rapidement\n- Plus efficacement\n- Moins cher\n\nEnalean édite la technologie \u003ca href\u003d\"https://www.enalean.com/fr/services/tuleap-enterprise\"\u003e Tuleap Enterprise, la première suite intégrée de Gestion des Développements Logiciels 100% Open Source \u003c/a\u003e\n\n\n\nAgilité, Open Source, Innovation ouverte, les maitres mots de Enalean. \n\nCréateurs de l\u0027\u003ca href\u003d\" https://www.enalean.com/fr/services/open-roadmap\"\u003eOpen Roadmap\u003c/a\u003e\n, un service innovant de mutualisation des développements logiciels.","urlimage":"http://www.gravatar.com/avatar/66310e813a80c52613506e2777778e8d","nbConsults":335,"sharedLinks":[{"name":"Site web","url":"https://www.enalean.com/fr"},{"name":"Blog","url":"https://www.enalean.com/fr/blog"}]},{"logo":"http://www.mix-it.fr/public/images/logo-erdf-linky.png","level":"BRONZE","id":2871,"lastName":"Linky ERDF","login":"ERDF-Linky","company":"ERDF","shortdesc":"Linky c\u0027est le projet de compteurs communicants d\u0027ERDF. Linky c\u0027est aussi un SI, réalisé à Lyon par 200 passionnés !","longdesc":"","urlimage":"http://www.gravatar.com/avatar/097f3ccb34f5879e73eecccc70a97cdd","nbConsults":455,"sharedLinks":[{"name":"ERDF","url":"http://www.erdf.fr"}]},{"logo":"http://www.mix-it.fr/public/images/logo-stormshield.jpg","level":"SILVER","id":2941,"lastName":"Stormshield","login":"stormshield","company":"stormshield.eu","shortdesc":"Arkoon et Netasq, filiales à 100% d’Airbus Defence and Space, opèrent la marque Stormshield - éditeur de solutions de sécurité","longdesc":"Arkoon et Netasq, filiales à 100% d’Airbus Defence and Space, opèrent la marque Stormshield et proposent tant en France qu’à l’international des solutions de sécurité de bout-en-bout innovantes pour protéger les réseaux (Stormshield Network Security), les postes de travail (Stormshield Endpoint Security) et les données (Stormshield Data Security).\nCes solutions de confiance de nouvelle génération, certifiées au plus haut niveau européen  (EU RESTRICTED, OTAN et ANSSI EAL4+), assurent la protection des informations stratégiques et sont déployées au travers d’un réseau de partenaires de distribution, d’intégrateurs et d’opérateurs dans des entreprises de toute taille, des institutions gouvernementales et des organismes de défense partout dans le monde.","urlimage":"http://www.gravatar.com/avatar/581d542afebb10f06ad073790e7cef18","nbConsults":354,"sharedLinks":[{"name":"Site web corporate","url":"http://www.stormshield.eu"}]},{"logo":"http://www.mix-it.fr/public/images/logo-worldline.jpg","level":"SILVER","id":2971,"firstName":"","lastName":"Worldline","login":"WorldlineFrance","company":"Worldline","shortdesc":"Worldline est le leader européen et un acteur mondial de référence dans le secteur des paiements et des services transactionnels.","longdesc":"Worldline [Euronext : WLN] est le leader européen et un acteur mondial de référence dans le secteur des paiements et des services transactionnels.Worldline met en place des services nouvelle génération, permettant à ses clients d’offrir au consommateur final des solutions innovantes et fluides.Acteur clef du B2B2C, riche de 40 ans d’expérience, Worldline sert et contribue au succès de toutes les entreprises et administrations, dans un marché en perpétuelle évolution.Worldline propose un Business Model unique et flexible, construit autour d’un portefeuille d’offres évolutif et global permettant une prise en charge end-to-end. Les activités de Worldline sont organisées autour de trois axes : Merchant Services \u0026 Terminals, Mobility \u0026 eTransactional Services, Financial Processing \u0026 Software Licensing. Worldline emploie plus de 7200 collaborateurs dans le monde entier et a généré un revenu (pro-forma) de 1,12 milliard d’euros en 2013. Worldline est une entreprise du Groupe Atos.","urlimage":"http://www.gravatar.com/avatar/de901dee6ea6d695afcaa886f336f753","nbConsults":421,"sharedLinks":[{"name":"Website","url":"http://fr.worldline.com/fr-fr/home.html"},{"name":"Facebook","url":"https://www.facebook.com/WorldlineFrance"}]},{"logo":"http://www.mix-it.fr/public/images/logo-elao.jpg","level":"BRONZE","id":3221,"lastName":"Elao","login":"Elao","company":"ELAO","shortdesc":"Elao est une agence de développement web 100 % technique, spécialiste des technologies Open source et experte Symfony. ","longdesc":"Agence de développement web fidèle à sa vocation initiale, Elao adopte depuis 10 ans une orientation 100 % technique. \n\nExperte Symfony et technos open source, Elao développe l\u0027ensemble de l\u0027applicatif des SI dans le respect des inconditionnels du web : qualité, sécurité, pérennité et pragmatisme.\n\nAccélérateur technologique de projets ambitieux, Elao s\u0027implique également dans les projets startup et dispose aujourd\u0027hui d\u0027un spectre de compétences techniques complet pour construire un projet, de sa conception à... son succès !\n\nPour cette nouvelle édition 2015, Elao présente un projet open source né d\u0027une expérience R\u0026D web et porté par son équipe : Le Curvytron http://curvytron.elao.com - @curvytron\n\nDéveloppé par la communauté Open Source, ce jeu multi-joueurs en ligne a pour vocation d’explorer des technos innovantes (Javascript Vanilla, Angular JS, HTML5 Canvas, Websocket, Node JS, GulpJS) et évidemment, de se divertir  !\n\n\n\n\n\n\n\n","urlimage":"http://www.gravatar.com/avatar/26fcb6af69d7b286d453de1658129d6d","nbConsults":294,"sharedLinks":[{"name":"Blog Elao","url":"http://www.elao.com/fr/blog"},{"name":"Curvytron","url":"http://www.curvytron.com/#/"}]},{"logo":"http://www.mix-it.fr/public/images/logo-isr.jpg","level":"BRONZE","id":3681,"lastName":"Informatique Systèmes Réseaux","login":"sourcingisr","company":"ISR","shortdesc":"Entreprise de service numérique, nous accompagnons nos clients dans l\u0027évolution de leurs SI depuis 1996.","longdesc":"Un positionnement historique régional et une stratégie de croissance mesurée nous apportent souplesse, adaptabilité et réactivité ainsi que la confiance renouvelée de nos collaborateurs et de nos clients. \n\nDepuis Août 2014 nous sommes aussi implantés à SHANGHAI !!!\n\n\n\n","urlimage":"http://www.gravatar.com/avatar/0d6f9ffae170cd61ae45dd38b2a42e38","nbConsults":192,"sharedLinks":[{"name":"Site ISR","url":"http://www.isr.fr/"},{"name":"ISR VIADEO","url":"http://www.viadeo.com/fr/company/isr-informatique-systemes-reseaux"}]}]